base/Documents/бит_ЗакрытиеКонтрольныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ЗакрытиеКонтрольныхЗначений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыКонтроляПоБюджету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийКонтролируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_РежимыКонтроляПоБюджету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыКонтроляПоБюджету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикиДоговоров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_ЗакрытиеКонтрольныхЗначений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, 
			Пользователи.ТекущийПользователь(), Неопределено,, Ложь);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_ЗакрытиеКонтрольныхЗначений.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
			
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
		
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(
		ПараметрыПроведения.КонтрольныеЗначения, 
		Движения);
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	Если ВидКонтроля <> Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		НепроверяемыеРеквизиты.Добавить("СценарийКонтролируемый");
	КонецЕсли; 
			
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты); 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;

	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	// Для графиков и заявок контроль:
	// - Сценарий контролируемый совпадает с базовым.
	Если ВидКонтроля <> Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		СценарийКонтролируемый = Сценарий;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Комментарий   = "";
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли
